B35doc/English/online/cfysm_C2/samples/ElectricalIntegration/ElectricalBundle1.1.xml

<!--Important: use only API to modify this file !-->

<SOAP_ENV:Envelope xmlns:NS1 = "CATIA/V5/Electrical/1.0" xmlns:NS2 = "http://www.ixfstd.org/std/ns/core/classBehaviors/links/1.0" xmlns:ixf = "http://www.ixfstd.org/std/ns/core/1.0" xmlns:tns = "IXF_Schema.xsd" xmlns:xsi = "http://www.w3.org/2001/XMLSchema-instance" xmlns:SOAP_ENV = "http://schemas.xmlsoap.org/soap/envelope/" xsi:schemaLocation = "IXF_Schema.xsd ElectricalSchema.xsd"><SOAP_ENV:Body><ixf:object id = "ElecBundle1" xsi:type = "tns:Harness"><tns:Name>Electrical Bundle1.1</tns:Name>
</ixf:object>
<ixf:object id = "WireA" xsi:type = "tns:Wire"><tns:Name>Wire-minusA</tns:Name>
<NS1:Wire><NS1:Length>0.463247</NS1:Length>
<NS1:Color>Green</NS1:Color>
<NS1:LinearMass>0.256</NS1:LinearMass>
<NS1:OuterDiameter>0.0052</NS1:OuterDiameter>
</NS1:Wire>
<NS1:Product><NS1:PartNumber>PN-AMP-3403B</NS1:PartNumber>
</NS1:Product>
</ixf:object>
<ixf:object id = "UID80" xsi:type = "tns:HarnessLink"><NS2:link><NS2:object1 href = "#ElecBundle1"/>
<NS2:object2 href = "#WireA"/>
</NS2:link>
</ixf:object>
<ixf:object id = "UID81" xsi:type = "tns:WireLink"><NS2:link><NS2:object1 href = "#Interco Male Pin2"/>
<NS2:object2 href = "#WireA"/>
</NS2:link>
</ixf:object>
<ixf:object id = "UID82" xsi:type = "tns:WireLink"><NS2:link><NS2:object1 href = "#Hair-dryer"/>
<NS2:object2 href = "#WireA"/>
</NS2:link>
</ixf:object>
<ixf:object id = "WireB" xsi:type = "tns:Wire"><tns:Name>Wire-checkB</tns:Name>
<NS1:Wire><NS1:Length>0.463247</NS1:Length>
<NS1:Color>black</NS1:Color>
<NS1:BendRadius>0.02</NS1:BendRadius>
<NS1:OuterDiameter>0.00250007</NS1:OuterDiameter>
</NS1:Wire>
<NS1:Product><NS1:PartNumber>wire-2.5mm-black</NS1:PartNumber>
</NS1:Product>
</ixf:object>
<ixf:object id = "UID83" xsi:type = "tns:HarnessLink"><NS2:link><NS2:object1 href = "#ElecBundle1"/>
<NS2:object2 href = "#WireB"/>
</NS2:link>
</ixf:object>
<ixf:object id = "UID84" xsi:type = "tns:WireLink"><NS2:link><NS2:object1 href = "#Interco Male Pin1"/>
<NS2:object2 href = "#WireB"/>
</NS2:link>
</ixf:object>
<ixf:object id = "UID85" xsi:type = "tns:WireLink"><NS2:link><NS2:object1 href = "#Hair-dryer"/>
<NS2:object2 href = "#WireB"/>
</NS2:link>
</ixf:object>
<ixf:object id = "WireC" xsi:type = "tns:Wire"><tns:Name>Wire-plusC</tns:Name>
<NS1:Wire><NS1:Length>0.463247</NS1:Length>
<NS1:Color>yellow</NS1:Color>
<NS1:SubType> </NS1:SubType>
<NS1:BendRadius>0.02</NS1:BendRadius>
<NS1:OuterDiameter>0.002</NS1:OuterDiameter>
</NS1:Wire>
<NS1:Product><NS1:PartNumber>wire-2mm-yellow</NS1:PartNumber>
</NS1:Product>
</ixf:object>
<ixf:object id = "UID86" xsi:type = "tns:HarnessLink"><NS2:link><NS2:object1 href = "#ElecBundle1"/>
<NS2:object2 href = "#WireC"/>
</NS2:link>
</ixf:object>
<ixf:object id = "UID87" xsi:type = "tns:WireLink"><NS2:link><NS2:object1 href = "#Interco Male Pin3"/>
<NS2:object2 href = "#WireC"/>
</NS2:link>
</ixf:object>
<ixf:object id = "UID88" xsi:type = "tns:WireLink"><NS2:link><NS2:object1 href = "#Hair-dryer"/>
<NS2:object2 href = "#WireC"/>
</NS2:link>
</ixf:object>
<ixf:object id = "Interco Male" xsi:type = "tns:Connector"><tns:Name>Connector_M.1</tns:Name>
<NS1:Connector/>
<NS1:Product><NS1:PartNumber>Connector_M</NS1:PartNumber>
</NS1:Product>
</ixf:object>
<ixf:object id = "UID89" xsi:type = "tns:DeviceLink"><NS2:link><NS2:object1 href = "#Interco Male Pin1"/>
<NS2:object2 href = "#Interco Male"/>
</NS2:link>
</ixf:object>
<ixf:object id = "Interco Male Pin1" xsi:type = "tns:Pin"><tns:Name>Termination_minus</tns:Name>
</ixf:object>
<ixf:object id = "UID90" xsi:type = "tns:DeviceLink"><NS2:link><NS2:object1 href = "#Interco Male Pin2"/>
<NS2:object2 href = "#Interco Male"/>
</NS2:link>
</ixf:object>
<ixf:object id = "Interco Male Pin2" xsi:type = "tns:Pin"><tns:Name>Termination_plus</tns:Name>
</ixf:object>
<ixf:object id = "UID91" xsi:type = "tns:DeviceLink"><NS2:link><NS2:object1 href = "#Interco Male Pin3"/>
<NS2:object2 href = "#Interco Male"/>
</NS2:link>
</ixf:object>
<ixf:object id = "Interco Male Pin3" xsi:type = "tns:Pin"><tns:Name>Termination_check</tns:Name>
</ixf:object>
<ixf:object id = "Hair-dryer" xsi:type = "tns:Equipment"><tns:Name>Hair-dryer.1</tns:Name>
<NS1:Product><NS1:PartNumber>Hair-dryer</NS1:PartNumber>
</NS1:Product>
</ixf:object>
<ixf:object id = "UID92" xsi:type = "tns:DeviceLink"><NS2:link><NS2:object1 href = "#Hair-dryer Pin1"/>
<NS2:object2 href = "#Hair-dryer"/>
</NS2:link>
</ixf:object>
<ixf:object id = "Hair-dryer Pin1" xsi:type = "tns:Pin"><tns:Name>Termination_minus</tns:Name>
</ixf:object>
<ixf:object id = "UID93" xsi:type = "tns:DeviceLink"><NS2:link><NS2:object1 href = "#Hair-dryer Pin2"/>
<NS2:object2 href = "#Hair-dryer"/>
</NS2:link>
</ixf:object>
<ixf:object id = "Hair-dryer Pin2" xsi:type = "tns:Pin"><tns:Name>Termination_plus</tns:Name>
</ixf:object>
<ixf:object id = "UID94" xsi:type = "tns:DeviceLink"><NS2:link><NS2:object1 href = "#Hair-dryer Pin3"/>
<NS2:object2 href = "#Hair-dryer"/>
</NS2:link>
</ixf:object>
<ixf:object id = "Hair-dryer Pin3" xsi:type = "tns:Pin"><tns:Name>Termination_check</tns:Name>
</ixf:object>
</SOAP_ENV:Body>
</SOAP_ENV:Envelope>


